using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Microsoft.AspNetCore.Http;
using Microsoft.AspNetCore.Mvc;

namespace scoutsOfDniproSite.Controllers
{
    [Route("api/[controller]")]
    [ApiController]
    public class ScoutMinimumController : Controller
    {
        [HttpGet("/api/ScoutMinimum/{Key}")]
        public async Task<ActionResult<Object>> GetMinimumName(string Key)
        {
            var minimum = new string[46,3]{
                { "iScout1", "Успiшно склати вмiння 'Новак'.", "1"},
                { "iScout2", "Знати скаутський закон.", "2"},
                { "iScout3", "Знати i пояснити значення скаутських символiв().", "3"},
                { "iScout4", "Намалювати лiлiю i розповiсти iсторiю ii створення.", "4"},
                { "iScout5", "Знати структуру вiд ВОСР, НОСУ до гурту, партуля.", "5"},
                { "iScout6", "Знати i провести 3 рухливих гри i 3 iнтелектуальних гри для патруля/гурту.", "6"},
                { "iScout7", "Знати icторiю створення СО.", "7"},
                { "iScout8", "Взяти участь в патрульних/гуртових виiздах на природу(1 з ночiвлею, 2 одноденних)(виконати обранi обов'язки: (завгосп, господарник, фотограф тощо)).", "8"},
                { "iScout9", "Вміти цікаво розповісти про скаутинг, його суті і принципах незнайомій людині.", "9"},
                { "iScout10", "Провести духовну хвилинку.", "10"},
                { "iScout11", "Мати профіль на scout.org і створити там проект.", "11"},
                { "iScout12", "Опублікувати пост про скаутський захід в соцмережі.", "12"},
                { "iScout13", "Муштра:(знати і виконувати команди бунчужного, знати свистки і діяти відповідно до них, вільно здавати звіт патруля на шикуванні).", "12"},

                { "natureLife1", "Розпалити вогнище правильно і безпечно обладнати місце для багаття розпалити багаття з 3-х сірників, придатне для подальшого використання загасити багаття і прибрати вогнище, щоб не було ані диму, ані слідів.", "1"},
                { "natureLife2", "Вміти користуватися сокирою і пилкою показати і знати як правильно користуватися, передавати, транспортувати заготовити дрова на багаття за допомогою пилки і сокири.", "2"},
                { "natureLife3", "Вміти вибрати місце стоянки і обладнати вогнище знати правила вибору місця прибрати за собою місце стоянки.", "3"},
                { "natureLife4", "Знати 5 вузлів і їх застосування, обов'язкові вузли: удавка, прямий, схват, зв'язати мотузки різної товщини, натягнути мотузку між 2-х дерев.", "4"},
                { "natureLife5", "Зв'язати триногу мінімум в свій зріст знати як зафіксувати мотузки на початку і в кінці в’язання, тринога повинна витримати його вагу.", "5"},
                { "natureLife6", " Поставити і зібрати намет, знайти і пояснити безпечне для установки місце (вітро-, водо-, травмобезпечне), правильно встановити намет (може допомагати людина, мовчки), правильно скласти намет, знати правила зберігання і транспортування спільного спорядження.", "6"},
                { "natureLife7", "Правильно зібрати рюкзак.", "7"},
                { "natureLife8", "Скласти і мати список особистого спорядження для виїзду на природу з ночівлею.", "8"},
                { "natureLife9", "Встановити казанок на вогнище обладнати 2 види підвісу для казанка (трос, тринога, перекладина і т.п.).", "9"},
                { "natureLife10", "Скласти меню на патруль на 2 дня, скласти збалансоване меню, розподілити продукти по учасниках.", "10"},
                { "natureLife11", "Приготувати 1 першу страву і 2 види другої страви. Індивідуально.", "11"},
                { "natureLife12", "За допомогою компаса і карти поставити свою точку на карті і дійти до КП, визначивши азимут до КП, знати що таке масштаб, знати скільки км в см, кроків в см, кроків в 10м, кроків в 100м, вміти зорієнтувати карту.", "12"},
                { "natureLife13", "Визначити відстані на місцевості до 3-х предметів (ближній до 10м, середній до 100м, дальній до км з похибкою до 20%).", "13"},
                { "natureLife14", "Вміти користуватися страхувальної системою , одягнути самостійно страхувальну систему, правильно пересуватися на мотузкових перешкодах (переправа, паралельні, і тп), вміти користуватися карабінами.", "14"},
                { "natureLife15", "Вміти визначати сторони світу без компаса.", "15"},
                { "natureLife16", "Знати назву і розташування 5 сузірь.", "16"},

                { "lifeInSociety1", "Знати і заспівати гімн України, Гімн Скаутів Дніпра, 3 українські народні пісні та 5 скаутських пісень.", "1"},
                { "lifeInSociety2", "Знати 6 державних свят а також скаутські свята (дати).", "2"},
                { "lifeInSociety3", "Взяти участь в підготовці і проведенні одного зі свят для патруля/гурту.", "3"},
                { "lifeInSociety4", "Вміти звернутися в усі служби екстреної допомоги за номером (101-104).", "4"},
                { "lifeInSociety5", "Вміти знайти від місця своєї локації найближчу лікарню і поліцію.", "5"},
                { "lifeInSociety6", "Знати значення державної символіки.", "6"},
                { "lifeInSociety7", "Розповісти про 10 пам'ятних місць Дніпра, і 10 - України.", "7"},
                { "lifeInSociety8", "Розповісти про 10 історичних і 10 сучасних діячів.", "8"},
                
                { "iGood1", "Вмiти визначити вид травм i надавати першу допомогу при них(удари, опiки, порiз, вивих, розтягнення, перелом, тепловий удар, обмороження).", "1"},
                { "iGood2", "Провести ранкову зарядку.", "2"},
                { "iGood3", "Знати склад i мати особисту аптечку.", "3"},
                { "iGood4", "Знати розташування i призначення внутрiшнiх органiв людини.", "6"},
                { "iGood5", "Знати яку воду можна пити, де i як ii здобути, як зробити добуту воду питною.", "5"},
                { "iGood6", "Випрати i висушити свiй одяг i взуття в таборi/походi/выiздi.", "6"},
                { "iGood7", "Вмiти вимiрювати температуру, пульск i артерiальний тиск людини.", "7"},
                { "iGood8", "Зробити подарунок одному з батькiв (мамi, тату, бабусi, дiдусю) своiми руками.", "8"},
                { "iGood9", "Отримати рекомендацiю свого патруля i лiдера.", "9"},
            };
            for (int i = 0; i < 46; i++)
            {
                if (minimum[i, 0] == Key)
                {
                    return new ObjectResult(new { Key = minimum[i, 0], Value = minimum[i, 1], Id = minimum[i,2] });
                }
            }
            return NotFound();
        }
        [HttpGet("/api/ScoutMinimum")]
        public async Task<ActionResult<Object>> GetMinimum()
        {
            var minimum = new string[46, 3]{
                { "iScout1", "Успiшно склати вмiння 'Новак'.", "1"},
                { "iScout2", "Знати скаутський закон.", "2"},
                { "iScout3", "Знати i пояснити значення скаутських символiв().", "3"},
                { "iScout4", "Намалювати лiлiю i розповiсти iсторiю ii створення.", "4"},
                { "iScout5", "Знати структуру вiд ВОСР, НОСУ до гурту, партуля.", "5"},
                { "iScout6", "Знати i провести 3 рухливих гри i 3 iнтелектуальних гри для патруля/гурту.", "6"},
                { "iScout7", "Знати icторiю створення СО.", "7"},
                { "iScout8", "Взяти участь в патрульних/гуртових виiздах на природу(1 з ночiвлею, 2 одноденних)(виконати обранi обов'язки: (завгосп, господарник, фотограф тощо)).", "8"},
                { "iScout9", "Вміти цікаво розповісти про скаутинг, його суті і принципах незнайомій людині.", "9"},
                { "iScout10", "Провести духовну хвилинку.", "10"},
                { "iScout11", "Мати профіль на scout.org і створити там проект.", "11"},
                { "iScout12", "Опублікувати пост про скаутський захід в соцмережі.", "12"},
                { "iScout13", "Муштра:(знати і виконувати команди бунчужного, знати свистки і діяти відповідно до них, вільно здавати звіт патруля на шикуванні).", "12"},

                { "natureLife1", "Розпалити вогнище правильно і безпечно обладнати місце для багаття розпалити багаття з 3-х сірників, придатне для подальшого використання загасити багаття і прибрати вогнище, щоб не було ані диму, ані слідів.", "1"},
                { "natureLife2", "Вміти користуватися сокирою і пилкою показати і знати як правильно користуватися, передавати, транспортувати заготовити дрова на багаття за допомогою пилки і сокири.", "2"},
                { "natureLife3", "Вміти вибрати місце стоянки і обладнати вогнище знати правила вибору місця прибрати за собою місце стоянки.", "3"},
                { "natureLife4", "Знати 5 вузлів і їх застосування, обов'язкові вузли: удавка, прямий, схват, зв'язати мотузки різної товщини, натягнути мотузку між 2-х дерев.", "4"},
                { "natureLife5", "Зв'язати триногу мінімум в свій зріст знати як зафіксувати мотузки на початку і в кінці в’язання, тринога повинна витримати його вагу.", "5"},
                { "natureLife6", " Поставити і зібрати намет, знайти і пояснити безпечне для установки місце (вітро-, водо-, травмобезпечне), правильно встановити намет (може допомагати людина, мовчки), правильно скласти намет, знати правила зберігання і транспортування спільного спорядження.", "6"},
                { "natureLife7", "Правильно зібрати рюкзак.", "7"},
                { "natureLife8", "Скласти і мати список особистого спорядження для виїзду на природу з ночівлею.", "8"},
                { "natureLife9", "Встановити казанок на вогнище обладнати 2 види підвісу для казанка (трос, тринога, перекладина і т.п.).", "9"},
                { "natureLife10", "Скласти меню на патруль на 2 дня, скласти збалансоване меню, розподілити продукти по учасниках.", "10"},
                { "natureLife11", "Приготувати 1 першу страву і 2 види другої страви. Індивідуально.", "11"},
                { "natureLife12", "За допомогою компаса і карти поставити свою точку на карті і дійти до КП, визначивши азимут до КП, знати що таке масштаб, знати скільки км в см, кроків в см, кроків в 10м, кроків в 100м, вміти зорієнтувати карту.", "12"},
                { "natureLife13", "Визначити відстані на місцевості до 3-х предметів (ближній до 10м, середній до 100м, дальній до км з похибкою до 20%).", "13"},
                { "natureLife14", "Вміти користуватися страхувальної системою , одягнути самостійно страхувальну систему, правильно пересуватися на мотузкових перешкодах (переправа, паралельні, і тп), вміти користуватися карабінами.", "14"},
                { "natureLife15", "Вміти визначати сторони світу без компаса.", "15"},
                { "natureLife16", "Знати назву і розташування 5 сузірь.", "16"},

                { "lifeInSociety1", "Знати і заспівати гімн України, Гімн Скаутів Дніпра, 3 українські народні пісні та 5 скаутських пісень.", "1"},
                { "lifeInSociety2", "Знати 6 державних свят а також скаутські свята (дати).", "2"},
                { "lifeInSociety3", "Взяти участь в підготовці і проведенні одного зі свят для патруля/гурту.", "3"},
                { "lifeInSociety4", "Вміти звернутися в усі служби екстреної допомоги за номером (101-104).", "4"},
                { "lifeInSociety5", "Вміти знайти від місця своєї локації найближчу лікарню і поліцію.", "5"},
                { "lifeInSociety6", "Знати значення державної символіки.", "6"},
                { "lifeInSociety7", "Розповісти про 10 пам'ятних місць Дніпра, і 10 - України.", "7"},
                { "lifeInSociety8", "Розповісти про 10 історичних і 10 сучасних діячів.", "8"},

                { "iGood1", "Вмiти визначити вид травм i надавати першу допомогу при них(удари, опiки, порiз, вивих, розтягнення, перелом, тепловий удар, обмороження).", "1"},
                { "iGood2", "Провести ранкову зарядку.", "2"},
                { "iGood3", "Знати склад i мати особисту аптечку.", "3"},
                { "iGood4", "Знати розташування i призначення внутрiшнiх органiв людини.", "6"},
                { "iGood5", "Знати яку воду можна пити, де i як ii здобути, як зробити добуту воду питною.", "5"},
                { "iGood6", "Випрати i висушити свiй одяг i взуття в таборi/походi/выiздi.", "6"},
                { "iGood7", "Вмiти вимiрювати температуру, пульск i артерiальний тиск людини.", "7"},
                { "iGood8", "Зробити подарунок одному з батькiв (мамi, тату, бабусi, дiдусю) своiми руками.", "8"},
                { "iGood9", "Отримати рекомендацiю свого патруля i лiдера.", "9"},
            };
            var newMininmum = new List<Object>();
            for(int i = 0; i < 46; i++)
            {
                newMininmum.Add(new { Key = minimum[i, 0], Value = minimum[i, 1], Id = minimum[i, 2] });
            }
            return newMininmum;
        }
    }
}
